{
    "modelTopology": {
      "keras_version": "2.6.0",
      "backend": "tensorflow",
      "model_config": {
        "class_name": "Sequential",
        "config": {
          "layers": [
            {
              "class_name": "Dense",
              "config": {
                "units": 64,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {}
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "name": "dense_1",
                "trainable": true,
                "batch_input_shape": [null, 10]
              }
            },
            {
              "class_name": "Dense",
              "config": {
                "units": 1,
                "activation": "sigmoid",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {}
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "name": "dense_2",
                "trainable": true
              }
            }
          ],
          "name": "sequential"
        }
      }
    },
    "weightsManifest": {
      "paths": ["model.weights.bin"],
      "weights": [
        {
          "name": "dense_1/kernel",
          "shape": [10, 64],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "dense_2/kernel",
          "shape": [64, 1],
          "dtype": "float32"
        },
        {
          "name": "dense_2/bias",
          "shape": [1],
          "dtype": "float32"
        }
      ]
    }
  }
  